#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.discord_simde.discord_text_channel.games has changed
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.github.github_team_repository.payutc_payutc_mobile has changed
  ~ resource "github_team_repository" "payutc_payutc_mobile" {
      ~ etag       = "W/\"cd7c24bb49de9801a8c52f3a5825bbdeae70962a5300370dc8f0863b48dded65\"" -> "W/\"88cb4a72550408671a6ccd82ce833a60aeee1ec13bb868c113ffb37d73032cd6\""
        id         = "3158200:payutc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.simde_terraform has changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"9a3ce983a7a69fa5a3ff8e0a9fdba9ab3732592dc0fa1eda6460cc035d172300\"" -> "W/\"0b2c2280afada1d1c57e68cf98fd1d2dfcea2e69f0c9ef7f3e868ff3eb2ba8e9\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-comet.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "895025367050518539"
        name                     = "private-comet"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integ.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "802911396328767559"
        name                     = "private-integ"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.flairsou_flairsou-api has changed
  ~ resource "github_team_repository" "flairsou_flairsou-api" {
      ~ etag       = "W/\"3749a432e287674b69964e93c9a8c434273d46b899282600b53c6b76fc514db2\"" -> "W/\"b471a572a924ff3e5966f12371673d24a0cfdfa87d2ef9038c63d608591ccbd5\""
        id         = "4276153:flairsou-api"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkultra has changed
  ~ resource "github_team_repository" "gesasso_gesasso_mkultra" {
      ~ etag       = "W/\"fe5b668397c86af9dff811db90ebb420036fff4230e75c5a4a0dc88a93304b2c\"" -> "W/\"2986afa5896312ee785b2de500fef042ebc0bfe58d38df8af54ce33a54e88b09\""
        id         = "4673796:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_flairsou-api has changed
  ~ resource "github_team_repository" "simde_flairsou-api" {
      ~ etag       = "W/\"3749a432e287674b69964e93c9a8c434273d46b899282600b53c6b76fc514db2\"" -> "W/\"b471a572a924ff3e5966f12371673d24a0cfdfa87d2ef9038c63d608591ccbd5\""
        id         = "4217733:flairsou-api"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkultra has changed
  ~ resource "github_team_repository" "simde_gesasso_mkultra" {
      ~ etag       = "W/\"fe5b668397c86af9dff811db90ebb420036fff4230e75c5a4a0dc88a93304b2c\"" -> "W/\"2986afa5896312ee785b2de500fef042ebc0bfe58d38df8af54ce33a54e88b09\""
        id         = "4217733:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.everyone_games will be updated in-place
  ~ resource "discord_channel_permission" "everyone_games" {
      ~ allow        = 0 -> 103924288
      ~ deny         = 0 -> 197889
        id           = "1359208525"
        # (3 unchanged attributes hidden)
    }

  # module.discord_simde.discord_channel_permission.uvweb_general will be created
  + resource "discord_channel_permission" "uvweb_general" {
      + allow        = 100764736
      + channel_id   = "778331758302593074"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.uvweb_notifications will be created
  + resource "discord_channel_permission" "uvweb_notifications" {
      + allow        = 100762688
      + channel_id   = "778636669737369651"
      + deny         = 199937
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.uvweb_spam will be created
  + resource "discord_channel_permission" "uvweb_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.uvweb_sparkle will be created
  + resource "discord_channel_permission" "uvweb_sparkle" {
      + allow        = 100764736
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 17 -> 18
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.bde will be updated in-place
  ~ resource "discord_role" "bde" {
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.comet will be updated in-place
  ~ resource "discord_role" "comet" {
        id          = "895025366974992434"
        name        = "COMET"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.emploidut will be updated in-place
  ~ resource "discord_role" "emploidut" {
        id          = "814062042973339679"
        name        = "Emploi du temps"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.etuville will be updated in-place
  ~ resource "discord_role" "etuville" {
        id          = "886977202707648563"
        name        = "Etuville"
      ~ position    = 12 -> 13
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.gesasso will be updated in-place
  ~ resource "discord_role" "gesasso" {
        id          = "892342940226158603"
        name        = "Projet Gesasso"
      ~ position    = 9 -> 10
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integ will be updated in-place
  ~ resource "discord_role" "integ" {
        id          = "802911395758473247"
        name        = "Integ"
      ~ position    = 13 -> 14
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integfev will be updated in-place
  ~ resource "discord_role" "integfev" {
        id          = "897464433801060463"
        name        = "Integ Fev"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.jeffrey will be updated in-place
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 11 -> 12
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 15 -> 16
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.sparkle will be updated in-place
  ~ resource "discord_role" "sparkle" {
        id          = "938907292085125130"
        name        = "Projet Sparkle"
      ~ position    = 4 -> 5
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 14 -> 15
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.uvweb will be created
  + resource "discord_role" "uvweb" {
      + color       = 14737408
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = true
      + name        = "Projet UVWeb"
      + permissions = 103924288
      + position    = 4
      + server_id   = "759778767831957535"
    }

  # module.discord_simde.discord_role.woolly will be updated in-place
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 10 -> 11
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 16 -> 17
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.games will be updated in-place
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ sync_perms_with_category = false -> true
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.armand_ribault.discord_member_roles.member_role will be updated in-place
  ~ resource "discord_member_roles" "member_role" {
        id        = "693075349"
        # (2 unchanged attributes hidden)

      + role {
          + has_role = (known after apply)
          + role_id  = (known after apply)
        }
      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
      - role {
          - has_role = true -> null
          - role_id  = "784568395907465216" -> null
        }
    }

  # module.discord_simde.module.mathias_deroubaix.discord_member_roles.member_role will be updated in-place
  ~ resource "discord_member_roles" "member_role" {
        id        = "3488612923"
        # (2 unchanged attributes hidden)

      + role {
          + has_role = (known after apply)
          + role_id  = (known after apply)
        }
      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.private-admin.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331766016049173"
        name      = "private-admin"
      ~ position  = 13 -> 14
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-bde.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "811739465898000384"
        name      = "private-bde"
      ~ position  = 10 -> 11
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-comet.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "895025367050518539"
        name                     = "private-comet"
      ~ sync_perms_with_category = false -> true
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-emploidut.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "814062715789508648"
        name      = "private-emploidut"
      ~ position  = 11 -> 12
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-gesasso.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "892367298197876737"
        name      = "private-gesasso"
      ~ position  = 9 -> 10
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integ.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "802911396328767559"
        name                     = "private-integ"
      ~ sync_perms_with_category = false -> true
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "897464433268391946"
        name      = "private-integfev"
      ~ position  = 12 -> 13
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-uvweb.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "private-uvweb"
      + position  = 9
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.private-uvweb.discord_channel_permission.admin[0] will be created
  + resource "discord_channel_permission" "admin" {
      + allow        = 100696136
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778778212991066"
      + type         = "role"
    }

  # module.discord_simde.module.private-uvweb.discord_channel_permission.member_denied[0] will be created
  + resource "discord_channel_permission" "member_denied" {
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.module.private-uvweb.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-uvweb"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.private-uvweb.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-uvweb"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

  # module.discord_simde.module.simon_vital.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "688848083714703414"

      + role {
          + has_role = (known after apply)
          + role_id  = (known after apply)
        }
    }

Plan: 11 to add, 25 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @noeamiot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*